#Выведите все ключи и значения через цикл.
#d = {'Red':1, 'Green':2}
d = {'Red':1, 'Green':2}
for key, value in d.items():
    print(key, value, sep="\n")
print(d)