#Выведите все ключи и значения через цикл.
#d = {'Red':1, 'Green':2}
d = {'Red':1, 'Green':2}
for i in d.keys():
    print(i)
print(d)